       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.

       ENVIRONMENT DIVISION.

       DATA DIVISION.

       PROCEDURE DIVISION.

           DISPLAY "====================================".
           DISPLAY "       MICRO FOCUS COBOL LAB".
           DISPLAY "       FIRST COBOL PROGRAM".
           DISPLAY "====================================".
           DISPLAY " ".
           DISPLAY "Hello from Enterprise COBOL!".
           DISPLAY "This is my first program.".
           DISPLAY " ".

           STOP RUN.
           