       01  TRANSACTION-RECORD.
           05  TRX-ID          PIC X(6).
           05  TRX-ACCOUNT     PIC X(10).
           05  TRX-AMOUNT      PIC 9(10)V99.
           05  TRX-STATUS      PIC X(8).
           05  TRX-CURRENCY    PIC X(4).
           